In [2]:
import pandas as pd

Документация по использованию всех функций и методов библиотеки: http://pandas.pydata.org/pandas-docs/stable/index.html

# Основные объекты Pandas

### Series

In [4]:
s = pd.Series(data = [1, 2, 3, 4, 5], index = 'one two three four five'.split())

In [5]:
s

one      1
two      2
three    3
four     4
five     5
dtype: int64

In [6]:
s['one']

1

### DataFrame

In [7]:
df = pd.DataFrame({'name': 'Иванов Петров Сидоров'.split(), 'age': [25, 41, 18]})

In [8]:
df

      name  age
0   Иванов   25
1   Петров   41
2  Сидоров   18

In [9]:
df['name']

0     Иванов
1     Петров
2    Сидоров
Name: name, dtype: object

In [10]:
df.loc[1]['name']

'Петров'

In [12]:
df.iloc[1][:]

name    Петров
age         41
Name: 1, dtype: object

# Загружаем датасет и смотрим, что в нем есть

Для работы будем использовать известный датасет, содержащий информацию о пассажирах Титаника. Скачать датасет и посмотреть его описание можно по адресу: https://www.kaggle.com/c/titanic/data

In [13]:
df = pd.read_csv('train.csv')

In [17]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [19]:
df.describe()
#Будьте осторожны с этим методом при работе с большими датасетами!

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [20]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
PassengerId,891.0,446.000000,257.353842,1.00,223.5000,446.0000,668.5,891.0000
Survived,891.0,0.383838,0.486592,0.00,0.0000,0.0000,1.0,1.0000
Pclass,891.0,2.308642,0.836071,1.00,2.0000,3.0000,3.0,3.0000
Age,714.0,29.699118,14.526497,0.42,20.1250,28.0000,38.0,80.0000
SibSp,891.0,0.523008,1.102743,0.00,0.0000,0.0000,1.0,8.0000
Parch,891.0,0.381594,0.806057,0.00,0.0000,0.0000,0.0,6.0000
Fare,891.0,32.204208,49.693429,0.00,7.9104,14.4542,31.0,512.3292

Можно вывести на экран только определённые столбцы:

In [21]:
df[['Name', 'Age', 'Sex']].head()

                                                Name   Age     Sex
0                            Braund, Mr. Owen Harris  22.0    male
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0  female
2                             Heikkinen, Miss. Laina  26.0  female
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0  female
4                           Allen, Mr. William Henry  35.0    male

Выбираем из датасета строки, удовлетворяющие определённому условию:

In [22]:
df[df['Pclass'] == 1].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S

Считаем дополнительные статистические показатели для определённого столбца:

In [25]:
df['Fare'].min()

0.0

In [26]:
df[df['Pclass'] == 1]['Fare'].mean()

84.15468749999992

In [28]:
df[ df['Fare'] == 0]['Age'].max()

49.0

In [31]:
df[ df['Age'] >18 ]['Fare'].min()

0.0

# Эксперименты с группировками

## value_counts()

In [32]:
df['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [33]:
df[df['Sex'] == 'male']['Survived'].value_counts()

0    468
1    109
Name: Survived, dtype: int64

In [34]:
df[df['Sex'] == 'female']['Survived'].value_counts()

1    233
0     81
Name: Survived, dtype: int64

In [37]:
df[df['Pclass'] == 3]['Survived'].value_counts()

0    372
1    119
Name: Survived, dtype: int64

In [38]:
for sex in df["Sex"].unique():
    
    if sex == 'male':
        print('Данные о пассажирах - мужчинах')
    else:
        print('Данные о пассажирах - женщинах')
    
    print(df[df['Sex'] == sex]['Survived'].value_counts())
    print('')

Данные о пассажирах - мужчинах
0    468
1    109
Name: Survived, dtype: int64

Данные о пассажирах - женщинах
1    233
0     81
Name: Survived, dtype: int64

In [39]:
for sex in df["Sex"].unique():
    
    if sex == 'male':
        print('Данные о пассажирах - мужчинах')
    else:
        print('Данные о пассажирах - женщинах')
    
    for pclass in df['Pclass'].unique():
        print('{}-й класс'.format(pclass))
        print(df[(df['Sex'] == sex) & (df['Pclass'] == pclass)]['Survived'].value_counts())
        print('')

Данные о пассажирах - мужчинах
3-й класс
0    300
1     47
Name: Survived, dtype: int64

1-й класс
0    77
1    45
Name: Survived, dtype: int64

2-й класс
0    91
1    17
Name: Survived, dtype: int64

Данные о пассажирах - женщинах
3-й класс
1    72
0    72
Name: Survived, dtype: int64

1-й класс
1    91
0     3
Name: Survived, dtype: int64

2-й класс
1    70
0     6
Name: Survived, dtype: int64

## groupby()

In [40]:
df.groupby(by = 'Survived')['Age'].mean()

Survived
0    30.626179
1    28.343690
Name: Age, dtype: float64

In [41]:
df.groupby(by = ['Pclass', 'Survived'])['Age'].mean()

Pclass  Survived
1       0           43.695312
        1           35.368197
2       0           33.544444
        1           25.901566
3       0           26.555556
        1           20.646118
Name: Age, dtype: float64

In [42]:
df.groupby(by = 'Pclass')['Age', 'Fare'].agg([min, max])

         Age       Fare
         min   max  min       max
Pclass
1       0.92  80.0  0.0  512.3292
2       0.67  70.0  0.0   73.5000
3       0.42  74.0  0.0   69.5500

In [43]:
df.groupby(by = ['Pclass', 'Survived'])['Age', 'Fare'].agg([min, max])

                   Age           Fare
                   min   max      min       max
Pclass Survived
1      0          2.00  71.0   0.0000  263.0000
       1          0.92  80.0  25.9292  512.3292
2      0         16.00  70.0   0.0000   73.5000
       1          0.67  62.0  10.5000   65.0000
3      0          1.00  74.0   0.0000   69.5500
       1          0.42  63.0   0.0000   56.4958

In [45]:
df.groupby(by = ['Sex', 'Pclass'])['Fare'].mean()

Sex     Pclass
female  1         106.125798
        2          21.970121
        3          16.118810
male    1          67.226127
        2          19.741782
        3          12.661633
Name: Fare, dtype: float64

## pivot_table()

In [46]:
df.pivot_table(values = 'Age', index = 'Survived', columns = 'Pclass', aggfunc = 'mean')

Pclass            1          2          3
Survived
0         43.695312  33.544444  26.555556
1         35.368197  25.901566  20.646118

In [47]:
df.pivot_table(values = 'Fare', index = 'Survived', columns = ['Pclass', 'Sex'], aggfunc = ['min','mean', 'max'])

              min                                          mean            \
Pclass          1               2            3                1
Sex        female     male female  male female male      female      male
Survived
0         28.7125   0.0000   10.5   0.0  6.750  0.0  110.604167  62.89491
1         25.9292  26.2875   10.5  10.5  7.225  0.0  105.978159  74.63732

                                                           max            \
Pclass            2                     3                    1
Sex          female       male     female       male    female      male
Survived
0         18.250000  19.488965  19.773093  12.204469  151.5500  263.0000
1         22.288989  21.095100  12.464526  15.579696  512.3292  512.3292


Pclass        2              3
Sex      female  male   female     male
Survived
0          26.0  73.5  69.5500  69.5500
1          65.0  39.0  31.3875  56.4958

In [48]:
df2 = df.pivot_table(values = 'Fare', index = 'Survived', columns = ['Pclass', 'Sex'], aggfunc = ['min','mean', 'max'])

In [50]:
df2.loc[0]['min'][1]['female']

28.7125

In [51]:
df.pivot_table(values = 'Fare', index = 'Pclass', columns = 'Sex', aggfunc=['min', 'mean', 'max'])

            min             mean                  max
Sex      female male      female       male    female      male
Pclass
1       25.9292  0.0  106.125798  67.226127  512.3292  512.3292
2       10.5000  0.0   21.970121  19.741782   65.0000   73.5000
3        6.7500  0.0   16.118810  12.661633   69.5500   69.5500

In [53]:
df.pivot_table(values = 'SibSp', index = 'Survived', columns = 'Pclass', aggfunc = 'mean')

Pclass           1         2         3
Survived
0         0.287500  0.319588  0.672043
1         0.492647  0.494253  0.436975

In [ ]:
import numpy as np

# Изменение датафрейма

In [64]:
df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,alone
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.25,S,not alone
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.28,C,not alone
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.92,S,alone
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.10,S,not alone
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.05,S,alone

In [70]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 10 columns):
Survived    891 non-null int64
Pclass      891 non-null int64
Name        891 non-null object
Sex         891 non-null object
Age         891 non-null float64
SibSp       891 non-null int64
Parch       891 non-null int64
Fare        891 non-null float64
Embarked    891 non-null object
alone       891 non-null object
dtypes: float64(2), int64(4), object(4)
memory usage: 69.7+ KB

In [55]:
df.drop(['PassengerId', 'Ticket', 'Cabin'], axis = 1, inplace = True)

In [57]:
df['Fare'] = round(df['Fare'], 2)

In [60]:
df['Embarked'].fillna('No data', inplace = True)

In [62]:
def is_alone(row):
    if  row['SibSp'] > 0 or row['Parch'] > 0:
        return 'not alone'
    else:
        return 'alone'

In [63]:
df['alone'] = df.apply(is_alone, axis = 1)

In [65]:
df.pivot_table(values = 'Name', index = 'Survived', columns = 'alone', aggfunc = 'count')

alone     alone  not alone
Survived
0           374        175
1           163        179

In [66]:
age_1 = df[df['Pclass'] == 1]['Age'].mean()
age_2 = df[df['Pclass'] == 2]['Age'].mean()
age_3 = df[df['Pclass'] == 3]['Age'].mean()

In [68]:
def fill_age(row):
    if pd.isnull(row['Age']):
        if row['Pclass'] == 1:
            return age_1
        elif row['Pclass'] == 2:
            return age_2
        else:
            return age_3
    return int(row['Age'])

In [69]:
df['Age'] = df.apply(fill_age, axis = 1)